demo3/doc/readme.org
#+TITLE: Portable expressions in Nim

#+AUTHOR: Xiao-Yong Jin and James C. Osborn

#+OPTIONS: toc:2
#+HTML_HEAD_EXTRA: <style type="text/css">
#+HTML_HEAD_EXTRA: <!--
#+HTML_HEAD_EXTRA: body {font-family: 'Lucida Bright OT','Source Serif Pro',Serif;
#+HTML_HEAD_EXTRA:       font-size: 18pt;
#+HTML_HEAD_EXTRA:       line-height: 1.5;}
#+HTML_HEAD_EXTRA: pre {font-family: 'Lucida Console DK','Source Code Pro',monospace;
#+HTML_HEAD_EXTRA:      line-height: 1.2;}
#+HTML_HEAD_EXTRA: -->
#+HTML_HEAD_EXTRA: </style>

* Code portability in Nim

Here's an benchmark example.

#+BEGIN_SRC nim -n
import timing, cpugpuarray, qexLite/metaUtils, math

proc test(vecLen, memLen: static[int]; N: int) =
  var
    x = newColorMatrixArray(vecLen,memLen,N) # array of N 3x3 single prec complex matrices
    y = newColorMatrixArray(vecLen,memLen,N)
    z = newColorMatrixArray(vecLen,memLen,N)
    rep = 0                     # accumulates the number of runs

  let
    mr = float(3 * 8 * x.T.N * x.T.N * N) / float(1024 * 1024 * 1024) # Resident memory in 2^30 bytes
    mt = 4 * mr / 3             # Memory transaction
    fp = float(8 * x.T.N * x.T.N * x.T.N * N) * 1e-9 # Floating point op / 10^9
  template timeit(label:string, s:untyped) =
    var
      R {.global.}:int
      T {.global.}:float
    threadSingle:
      R = 128                   # Base repeat
      T = 1.0                   # Time limit
    var t = timex(rep, R, s)    # Always warm up cache
    while true:
      threadSingle:
        R = min(64*R,max(R,int(R.float*0.8/t))) # set up to run for at least 0.8 sec or 64*R
      t = timex(rep, R, s)
      threadSingle: T -= t
      if T < 0: break
    threadSingle:               # Use the last R & t for performance measure
      printf("%8d %3d %d %-8s rep: %7d KB: %8.0f ms: %8.4f GF/s: %7.2f GB/s: %7.2f\n",
             N, vecLen, memLen, label, R, 1024*1024*mr, 1e3*t/R.float, fp*R.float/t, mt*R.float/t)

  threads:                      # CPU threads
    x := 0                      # set them to diagonal matrices on CPU
    y := 1
    z := 2
    timeit "CPU": x += y * z

  timeit "GPU5":                # includes kernel launching and synchronization
    onGpu(N, 32):               # Number of threads, threads per block
      x += y * z
  timeit "GPU6": onGpu(N, 64): x += y * z
  timeit "GPU7": onGpu(N, 128): x += y * z

  threads: timeit "CPU": x += y * z # back to CPU threads again

  let scale = 0.5 / (sqrt(3.0) * rep.float)
  threads:
    x *= scale
    var n = x.norm2
    threadSingle: echo "# Final scaled x.norm2: ",n,"  rep: ",rep
  x.free
  y.free
  z.free

for n in 8..26:
  staticFor v, 2, 7:
    when (1 shl v) >= (structsize(vectorizedElementType(float32)) div sizeof(float32)):
      staticFor ml, 1, 2:
        test(1 shl v, ml, 1 shl n)
#+END_SRC

The above can be compiled and run with

#+BEGIN_SRC sh
nim cpp -d:SSE -d:AVX -d:CPUVLEN=256 -d:release ex2
#+END_SRC

