demo3/doc/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-22 Tue 00:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portable expressions in Nim</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Xiao-Yong Jin and James C. Osborn" />
</head>
<body>
<div id="content">
<h1 class="title">Portable expressions in Nim</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org791025e">1. Code portability in Nim</a></li>
<li><a href="#orgb73c8cf">2. Implementation details</a></li>
<li><a href="#org52587bd">3. CPU threads</a></li>
<li><a href="#orga941f5a">4. Offloading</a>
<ul>
<li><a href="#org0003e95">4.1. The <code>kern</code> procedure in <code>onGpu</code></a></li>
<li><a href="#org8a361e2">4.2. Expression handling</a></li>
</ul>
</li>
<li><a href="#orgb01a135">5. AST based overloading for array operations</a></li>
</ul>
</div>
</div>

<div id="outline-container-org791025e" class="outline-2">
<h2 id="org791025e"><span class="section-number-2">1</span> Code portability in Nim</h2>
<div class="outline-text-2" id="text-1">
<p>
Here's an benchmark example.
</p>

<div class="org-src-container">
<pre class="src src-nim"><span class="linenr"> 1: </span><span style="color: #718c00;">import</span> timing, cpugpuarray, qexLite/metaUtils, math
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #718c00;">proc</span><span style="color: #f5871f;"> test</span>(vecLen, memLen: <span style="color: #4271ae;">static</span>[<span style="color: #4271ae;">int</span>]; N: <span style="color: #4271ae;">int</span>) =
<span class="linenr"> 4: </span>  <span style="color: #718c00;">var</span>
<span class="linenr"> 5: </span>    x = newColorMatrixArray(vecLen,memLen,N) <span style="color: #8e908c; font-style: italic;"># array of N 3x3 single prec complex matrices</span>
<span class="linenr"> 6: </span>    y = newColorMatrixArray(vecLen,memLen,N)
<span class="linenr"> 7: </span>    z = newColorMatrixArray(vecLen,memLen,N)
<span class="linenr"> 8: </span>    rep = <span style="font-style: italic;">0</span>                     <span style="color: #8e908c; font-style: italic;"># accumulates the number of runs</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  <span style="color: #718c00;">let</span>
<span class="linenr">11: </span>    mr = <span style="color: #4271ae;">float</span>(<span style="font-style: italic;">3</span> * <span style="font-style: italic;">8</span> * x.T.N * x.T.N * N) / <span style="color: #4271ae;">float</span>(<span style="font-style: italic;">1024</span> * <span style="font-style: italic;">1024</span> * <span style="font-style: italic;">1024</span>) <span style="color: #8e908c; font-style: italic;"># Resident memory in 2^30 bytes</span>
<span class="linenr">12: </span>    mt = <span style="font-style: italic;">4</span> * mr / <span style="font-style: italic;">3</span>             <span style="color: #8e908c; font-style: italic;"># Memory transaction</span>
<span class="linenr">13: </span>    fp = <span style="color: #4271ae;">float</span>(<span style="font-style: italic;">8</span> * x.T.N * x.T.N * x.T.N * N) * 1e-<span style="font-style: italic;">9</span> <span style="color: #8e908c; font-style: italic;"># Floating point op / 10^9</span>
<span class="linenr">14: </span>  <span style="color: #718c00;">template</span><span style="color: #f5871f;"> timeit</span>(label:<span style="color: #4271ae;">string</span>, s:<span style="color: #4271ae;">untyped</span>) =
<span class="linenr">15: </span>    <span style="color: #718c00;">var</span>
<span class="linenr">16: </span>      R {.<span style="color: #8959a8;">global</span>.}:<span style="color: #4271ae;">int</span>
<span class="linenr">17: </span>      T {.<span style="color: #8959a8;">global</span>.}:<span style="color: #4271ae;">float</span>
<span class="linenr">18: </span>    threadSingle:
<span class="linenr">19: </span>      R = <span style="font-style: italic;">128</span>                   <span style="color: #8e908c; font-style: italic;"># Base repeat</span>
<span class="linenr">20: </span>      T = <span style="font-style: italic;">1</span>.<span style="font-style: italic;">0</span>                   <span style="color: #8e908c; font-style: italic;"># Time limit</span>
<span class="linenr">21: </span>    <span style="color: #718c00;">var</span> <span style="color: #eab700;">t </span>= timex(rep, R, s)    <span style="color: #8e908c; font-style: italic;"># Always warm up cache</span>
<span class="linenr">22: </span>    <span style="color: #718c00;">while</span> <span style="color: #4271ae;">true</span>:
<span class="linenr">23: </span>      threadSingle:
<span class="linenr">24: </span>        R = <span style="color: #8959a8;">min</span>(<span style="font-style: italic;">64</span>*R,<span style="color: #8959a8;">max</span>(R,<span style="color: #4271ae;">int</span>(R.<span style="color: #4271ae;">float</span>*<span style="font-style: italic;">0</span>.<span style="font-style: italic;">8</span>/t))) <span style="color: #8e908c; font-style: italic;"># set up to run for at least 0.8 sec or 64*R</span>
<span class="linenr">25: </span>      t = timex(rep, R, s)
<span class="linenr">26: </span>      threadSingle: T -= t
<span class="linenr">27: </span>      <span style="color: #718c00;">if</span> T &lt; <span style="font-style: italic;">0</span>: <span style="color: #718c00;">break</span>
<span class="linenr">28: </span>    threadSingle:               <span style="color: #8e908c; font-style: italic;"># Use the last R &amp; t for performance measure</span>
<span class="linenr">29: </span>      printf(<span style="color: #3e999f;">"%8d %3d %d %-8s rep: %7d KB: %8.0f ms: %8.4f GF/s: %7.2f GB/s: %7.2f\n"</span>,
<span class="linenr">30: </span>             N, vecLen, memLen, label, R, <span style="font-style: italic;">1024</span>*<span style="font-style: italic;">1024</span>*mr, 1e3*t/R.<span style="color: #4271ae;">float</span>, fp*R.<span style="color: #4271ae;">float</span>/t, mt*R.<span style="color: #4271ae;">float</span>/t)
<span class="linenr">31: </span>
<span class="linenr">32: </span>  threads:                      <span style="color: #8e908c; font-style: italic;"># CPU threads</span>
<span class="linenr">33: </span>    x := <span style="font-style: italic;">0</span>                      <span style="color: #8e908c; font-style: italic;"># set them to diagonal matrices on CPU</span>
<span class="linenr">34: </span>    y := <span style="font-style: italic;">1</span>
<span class="linenr">35: </span>    z := <span style="font-style: italic;">2</span>
<span class="linenr">36: </span>    timeit <span style="color: #3e999f;">"CPU"</span>: x += y * z
<span class="linenr">37: </span>
<span class="linenr">38: </span>  timeit <span style="color: #3e999f;">"GPU5"</span>:                <span style="color: #8e908c; font-style: italic;"># includes kernel launching and synchronization</span>
<span class="linenr">39: </span>    onGpu(N, <span style="font-style: italic;">32</span>):               <span style="color: #8e908c; font-style: italic;"># Number of threads, threads per block</span>
<span class="linenr">40: </span>      x += y * z
<span class="linenr">41: </span>  timeit <span style="color: #3e999f;">"GPU6"</span>: onGpu(N, <span style="font-style: italic;">64</span>): x += y * z
<span class="linenr">42: </span>  timeit <span style="color: #3e999f;">"GPU7"</span>: onGpu(N, <span style="font-style: italic;">128</span>): x += y * z
<span class="linenr">43: </span>
<span class="linenr">44: </span>  threads: timeit <span style="color: #3e999f;">"CPU"</span>: x += y * z <span style="color: #8e908c; font-style: italic;"># back to CPU threads again</span>
<span class="linenr">45: </span>
<span class="linenr">46: </span>  <span style="color: #718c00;">let</span> <span style="color: #eab700;">scale </span>= <span style="font-style: italic;">0</span>.<span style="font-style: italic;">5</span> / (sqrt(<span style="font-style: italic;">3</span>.<span style="font-style: italic;">0</span>) * rep.<span style="color: #4271ae;">float</span>)
<span class="linenr">47: </span>  threads:
<span class="linenr">48: </span>    x *= scale
<span class="linenr">49: </span>    <span style="color: #718c00;">var</span> <span style="color: #eab700;">n </span>= x.norm2
<span class="linenr">50: </span>    threadSingle: <span style="color: #8959a8;">echo</span> <span style="color: #3e999f;">"# Final scaled x.norm2: "</span>,n,<span style="color: #3e999f;">"  rep: "</span>,rep
<span class="linenr">51: </span>  x.free
<span class="linenr">52: </span>  y.free
<span class="linenr">53: </span>  z.free
<span class="linenr">54: </span>
<span class="linenr">55: </span><span style="color: #718c00;">for</span> n <span style="color: #718c00;">in</span> <span style="font-style: italic;">8</span>..<span style="font-style: italic;">26</span>:
<span class="linenr">56: </span>  staticFor v, <span style="font-style: italic;">2</span>, <span style="font-style: italic;">7</span>:
<span class="linenr">57: </span>    <span style="color: #718c00;">when</span> (<span style="font-style: italic;">1</span> <span style="color: #8959a8;">shl</span> v) &gt;= (structsize(vectorizedElementType(<span style="color: #4271ae;">float32</span>)) <span style="color: #8959a8;">div</span> <span style="color: #8959a8; font-style: italic;">sizeof</span>(<span style="color: #4271ae;">float32</span>)):
<span class="linenr">58: </span>      staticFor ml, <span style="font-style: italic;">1</span>, <span style="font-style: italic;">2</span>:
<span class="linenr">59: </span>        test(<span style="font-style: italic;">1</span> <span style="color: #8959a8;">shl</span> v, ml, <span style="font-style: italic;">1</span> <span style="color: #8959a8;">shl</span> n)
</pre>
</div>

<p>
The above can be compiled and run with
</p>

<div class="org-src-container">
<pre class="src src-sh">nim cpp -d:SSE -d:AVX -d:<span style="color: #eab700;">CPUVLEN</span>=256 -d:release ex2
</pre>
</div>
</div>
</div>
