demo3/doc/readme.org
* Implementation details

The main container object in the example above is an array that can live
on the CPU and also the GPU.  This is defined as

#+BEGIN_SRC nim -n
when useGPU:
  type
    ArrayObj*[V,M:static[int],T] = object
      p*: Coalesced[V,M,T]
      n*: int
      g*: GpuArrayObj[V,M,T]
      lastOnGpu*: bool
      unifiedMem*: bool
      mem:pointer ## Pointer to the allocated memory.
else:
  type
    ArrayObj*[V,M:static[int],T] = object
      p*: Coalesced[V,M,T]
      n*: int
      mem:pointer ## Pointer to the allocated memory.

type
  GpuArrayObj*[V,M:static[int],T] = object
    p*: Coalesced[V,M,T]
    n*: int

type
  Coalesced*[V,M:static[int],T] = object
    ## `V`: Inner array length.
    ## `M`: Number of RegisterWords in a MemoryWord, the granularity of memory transactions.
    p*: ptr T                   ## pointer to an array of T
    n*: int                     ## the length of the array being coalesced
  CoalescedObj[V,M:static[int],T] = object
    o*: Coalesced[V,M,T]
    i*: int                     # the index to which we asks

template `[]`*(x:Coalesced, ix:int):untyped = CoalescedObj[x.V,x.M,x.T](o:x, i:ix)
template len*(x:Coalesced):untyped = x.n

template fromCoalesced*(x:CoalescedObj):untyped =
  const N = getSize(x.T) div (x.M*sizeof(RegisterWord))
  type A {.unchecked.}= ptr array[0,MemoryWord(x.M)]
  var r {.noinit.}: x.T
  let offset = (x.i div x.V)*N*x.V + x.i mod x.V
  staticfor j, 0, N-1: cast[A](r.addr)[j] = cast[A](x.o.p)[offset + j*x.V]
  r

type
  ShortVector*[V:static[int],E] = object
    a*:array[V,E]
  ShortVectorIndex* = distinct int
  VectorizedObj*[V,M:static[int],T] = object
    o*:Coalesced[V,M,T]
    i*:ShortVectorIndex

template `[]`*(x:Coalesced, ix:ShortVectorIndex):untyped = VectorizedObj[x.V,x.M,x.T](o:x,i:ix)
template veclen*(x:Coalesced):untyped = x.n div x.V
#+END_SRC

