demo3/doc/readme.html

<div id="outline-container-orgb73c8cf" class="outline-2">
<h2 id="orgb73c8cf"><span class="section-number-2">2</span> Implementation details</h2>
<div class="outline-text-2" id="text-2">
<p>
The main container object in the example above is an array that can live
on the CPU and also the GPU.  This is defined as
</p>

<div class="org-src-container">
<pre class="src src-nim"><span class="linenr"> 1: </span><span style="color: #718c00;">when</span> useGPU:
<span class="linenr"> 2: </span>  <span style="color: #718c00;">type</span>
<span class="linenr"> 3: </span>    ArrayObj*[V,M:<span style="color: #718c00;">static</span>[<span style="color: #4271ae;">int</span>],T] = <span style="color: #718c00;">object</span>
<span class="linenr"> 4: </span>      <span style="color: #f5871f; font-weight: bold; font-style: italic;">p*</span>: Coalesced[V,M,T]
<span class="linenr"> 5: </span>      <span style="color: #f5871f; font-weight: bold; font-style: italic;">n*</span>: <span style="color: #4271ae;">int</span>
<span class="linenr"> 6: </span>      <span style="color: #f5871f; font-weight: bold; font-style: italic;">g*</span>: GpuArrayObj[V,M,T]
<span class="linenr"> 7: </span>      <span style="color: #f5871f; font-weight: bold; font-style: italic;">lastOnGpu*</span>: <span style="color: #4271ae;">bool</span>
<span class="linenr"> 8: </span>      <span style="color: #f5871f; font-weight: bold; font-style: italic;">unifiedMem*</span>: <span style="color: #4271ae;">bool</span>
<span class="linenr"> 9: </span>      mem:<span style="color: #4271ae;">pointer</span> <span style="color: #8959a8;">## Pointer to the allocated memory.</span>
<span class="linenr">10: </span><span style="color: #718c00;">else</span>:
<span class="linenr">11: </span>  <span style="color: #718c00;">type</span>
<span class="linenr">12: </span>    ArrayObj*[V,M:<span style="color: #718c00;">static</span>[<span style="color: #4271ae;">int</span>],T] = <span style="color: #718c00;">object</span>
<span class="linenr">13: </span>      <span style="color: #f5871f; font-weight: bold; font-style: italic;">p*</span>: Coalesced[V,M,T]
<span class="linenr">14: </span>      <span style="color: #f5871f; font-weight: bold; font-style: italic;">n*</span>: <span style="color: #4271ae;">int</span>
<span class="linenr">15: </span>      mem:<span style="color: #4271ae;">pointer</span> <span style="color: #8959a8;">## Pointer to the allocated memory.</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span><span style="color: #718c00;">type</span>
<span class="linenr">18: </span>  GpuArrayObj*[V,M:<span style="color: #718c00;">static</span>[<span style="color: #4271ae;">int</span>],T] = <span style="color: #718c00;">object</span>
<span class="linenr">19: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">p*</span>: Coalesced[V,M,T]
<span class="linenr">20: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">n*</span>: <span style="color: #4271ae;">int</span>
<span class="linenr">21: </span>
<span class="linenr">22: </span><span style="color: #718c00;">type</span>
<span class="linenr">23: </span>  Coalesced*[V,M:<span style="color: #718c00;">static</span>[<span style="color: #4271ae;">int</span>],T] = <span style="color: #718c00;">object</span>
<span class="linenr">24: </span>    <span style="color: #8959a8;">## </span><span style="color: #4271ae;">`V`</span><span style="color: #8959a8;">: Inner array length.</span>
<span class="linenr">25: </span>    <span style="color: #8959a8;">## </span><span style="color: #4271ae;">`M`</span><span style="color: #8959a8;">: Number of RegisterWords in a MemoryWord, the granularity of memory transactions.</span>
<span class="linenr">26: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">p*</span>: <span style="color: #718c00;">ptr</span> T                   <span style="color: #8959a8;">## pointer to an array of T</span>
<span class="linenr">27: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">n*</span>: <span style="color: #4271ae;">int</span>                     <span style="color: #8959a8;">## the length of the array being coalesced</span>
<span class="linenr">28: </span>  CoalescedObj[V,M:<span style="color: #718c00;">static</span>[<span style="color: #4271ae;">int</span>],T] = <span style="color: #718c00;">object</span>
<span class="linenr">29: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">o*</span>: Coalesced[V,M,T]
<span class="linenr">30: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">i*</span>: <span style="color: #4271ae;">int</span>                     <span style="color: #8e908c; font-style: italic;"># the index to which we asks</span>
<span class="linenr">31: </span>
<span class="linenr">32: </span><span style="color: #718c00;">template</span><span style="color: #f5871f; font-weight: bold; font-style: italic;"> `[]`*</span>(x:<span style="color: #4271ae;">Coalesced</span>, ix:<span style="color: #4271ae;">int</span>):<span style="color: #4271ae;">untyped</span> = CoalescedObj[x.V,x.M,x.T](o:<span style="color: #4271ae;">x</span>, i:<span style="color: #4271ae;">ix</span>)
<span class="linenr">33: </span><span style="color: #718c00;">template</span><span style="color: #f5871f; font-weight: bold; font-style: italic;"> len*</span>(x:<span style="color: #4271ae;">Coalesced</span>):<span style="color: #4271ae;">untyped</span> = x.n
<span class="linenr">34: </span>
<span class="linenr">35: </span><span style="color: #718c00;">template</span><span style="color: #f5871f; font-weight: bold; font-style: italic;"> fromCoalesced*</span>(x:<span style="color: #4271ae;">CoalescedObj</span>):<span style="color: #4271ae;">untyped</span> =
<span class="linenr">36: </span>  <span style="color: #718c00;">const</span> <span style="color: #eab700;">N </span>= getSize(x.T) <span style="color: #8959a8;">div</span> (x.M*<span style="color: #8959a8; font-style: italic;">sizeof</span>(RegisterWord))
<span class="linenr">37: </span>  <span style="color: #718c00;">type</span> <span style="color: #eab700;">A </span>{.<span style="color: #8959a8;">unchecked</span>.}= <span style="color: #718c00;">ptr</span> <span style="color: #4271ae;">array</span>[<span style="font-style: italic;">0</span>,MemoryWord(x.M)]
<span class="linenr">38: </span>  <span style="color: #718c00;">var</span> <span style="color: #eab700;">r </span>{.<span style="color: #8959a8;">noinit</span>.}: x.T
<span class="linenr">39: </span>  <span style="color: #718c00;">let</span> <span style="color: #eab700;">offset </span>= (x.i <span style="color: #8959a8;">div</span> x.V)*N*x.V + x.i <span style="color: #8959a8;">mod</span> x.V
<span class="linenr">40: </span>  staticfor j, <span style="font-style: italic;">0</span>, N-<span style="font-style: italic;">1</span>: <span style="color: #718c00;">cast</span>[A](r.<span style="color: #718c00;">addr</span>)[j] = <span style="color: #718c00;">cast</span>[A](x.o.p)[offset + j*x.V]
<span class="linenr">41: </span>  r
<span class="linenr">42: </span>
<span class="linenr">43: </span><span style="color: #718c00;">type</span>
<span class="linenr">44: </span>  ShortVector*[V:<span style="color: #718c00;">static</span>[<span style="color: #4271ae;">int</span>],E] = <span style="color: #718c00;">object</span>
<span class="linenr">45: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">a*</span>:<span style="color: #4271ae;">array</span>[V,E]
<span class="linenr">46: </span>  <span style="color: #f5871f; font-weight: bold; font-style: italic;">ShortVectorIndex*</span> = <span style="color: #718c00;">distinct</span> <span style="color: #4271ae;">int</span>
<span class="linenr">47: </span>  VectorizedObj*[V,M:<span style="color: #718c00;">static</span>[<span style="color: #4271ae;">int</span>],T] = <span style="color: #718c00;">object</span>
<span class="linenr">48: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">o*</span>:Coalesced[V,M,T]
<span class="linenr">49: </span>    <span style="color: #f5871f; font-weight: bold; font-style: italic;">i*</span>:ShortVectorIndex
<span class="linenr">50: </span>
<span class="linenr">51: </span><span style="color: #718c00;">template</span><span style="color: #f5871f; font-weight: bold; font-style: italic;"> `[]`*</span>(x:<span style="color: #4271ae;">Coalesced</span>, ix:<span style="color: #4271ae;">ShortVectorIndex</span>):<span style="color: #4271ae;">untyped</span> = VectorizedObj[x.V,x.M,x.T](o:<span style="color: #4271ae;">x</span>,i:<span style="color: #4271ae;">ix</span>)
<span class="linenr">52: </span><span style="color: #718c00;">template</span><span style="color: #f5871f; font-weight: bold; font-style: italic;"> veclen*</span>(x:<span style="color: #4271ae;">Coalesced</span>):<span style="color: #4271ae;">untyped</span> = x.n <span style="color: #8959a8;">div</span> x.V
</pre>
</div>
</div>
</div>
