demo3/doc/readme.org
** The ~kern~ procedure in ~onGpu~

#+BEGIN_SRC nim -n
proc kern(xx670162: ByCopy670160[type(v670158)])
     {.codegenDecl: "__global__ $# $#$#".} =
  var gridDim {.global, importC, noDecl.}: CudaDim3
  var blockIdx {.global, importC, noDecl.}: CudaDim3
  var blockDim {.global, importC, noDecl.}: CudaDim3
  var threadIdx {.global, importC, noDecl.}: CudaDim3
  template getGridDim(): untyped {.used.} = gridDim
  template getBlockIdx(): untyped {.used.} = blockIdx
  template getBlockDim(): untyped {.used.} = blockDim
  template getThreadIdx(): untyped {.used.} = threadIdx
  template getThreadNum(): untyped {.used.} = blockDim.x * blockIdx.x + threadIdx.x
  template getNumThreads(): untyped {.used.} = gridDim.x * blockDim.x
  inlineProcs:
    template deref(k670164: int): untyped =
      xx670162.d[k670164]
    substVars((x += y * z), deref)
#+END_SRC

