demo3/doc/readme.html

<div id="outline-container-org0003e95" class="outline-3">
<h3 id="org0003e95"><span class="section-number-3">4.1</span> The <code>kern</code> procedure in <code>onGpu</code></h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-nim"><span class="linenr"> 1: </span><span style="color: #718c00;">proc</span><span style="color: #f5871f;"> kern</span>(xx670162: <span style="color: #4271ae;">ByCopy670160</span>[<span style="color: #718c00;">type</span>(v670158)])
<span class="linenr"> 2: </span>     {.<span style="color: #8959a8;">codegenDecl</span>: <span style="color: #3e999f;">"__global__ </span><span style="color: #8959a8;">$#</span><span style="color: #3e999f;"> </span><span style="color: #8959a8;">$#$#</span><span style="color: #3e999f;">"</span>.} =
<span class="linenr"> 3: </span>  <span style="color: #718c00;">var</span> <span style="color: #eab700;">gridDim </span>{.<span style="color: #8959a8;">global</span>, <span style="color: #8959a8;">importC</span>, <span style="color: #8959a8;">noDecl</span>.}: CudaDim3
<span class="linenr"> 4: </span>  <span style="color: #718c00;">var</span> <span style="color: #eab700;">blockIdx </span>{.<span style="color: #8959a8;">global</span>, <span style="color: #8959a8;">importC</span>, <span style="color: #8959a8;">noDecl</span>.}: CudaDim3
<span class="linenr"> 5: </span>  <span style="color: #718c00;">var</span> <span style="color: #eab700;">blockDim </span>{.<span style="color: #8959a8;">global</span>, <span style="color: #8959a8;">importC</span>, <span style="color: #8959a8;">noDecl</span>.}: CudaDim3
<span class="linenr"> 6: </span>  <span style="color: #718c00;">var</span> <span style="color: #eab700;">threadIdx </span>{.<span style="color: #8959a8;">global</span>, <span style="color: #8959a8;">importC</span>, <span style="color: #8959a8;">noDecl</span>.}: CudaDim3
<span class="linenr"> 7: </span>  <span style="color: #718c00;">template</span><span style="color: #f5871f;"> getGridDim</span>(): <span style="color: #4271ae;">untyped</span> {.used.} = gridDim
<span class="linenr"> 8: </span>  <span style="color: #718c00;">template</span><span style="color: #f5871f;"> getBlockIdx</span>(): <span style="color: #4271ae;">untyped</span> {.used.} = blockIdx
<span class="linenr"> 9: </span>  <span style="color: #718c00;">template</span><span style="color: #f5871f;"> getBlockDim</span>(): <span style="color: #4271ae;">untyped</span> {.used.} = blockDim
<span class="linenr">10: </span>  <span style="color: #718c00;">template</span><span style="color: #f5871f;"> getThreadIdx</span>(): <span style="color: #4271ae;">untyped</span> {.used.} = threadIdx
<span class="linenr">11: </span>  <span style="color: #718c00;">template</span><span style="color: #f5871f;"> getThreadNum</span>(): <span style="color: #4271ae;">untyped</span> {.used.} = blockDim.x * blockIdx.x + threadIdx.x
<span class="linenr">12: </span>  <span style="color: #718c00;">template</span><span style="color: #f5871f;"> getNumThreads</span>(): <span style="color: #4271ae;">untyped</span> {.used.} = gridDim.x * blockDim.x
<span class="linenr">13: </span>  inlineProcs:
<span class="linenr">14: </span>    <span style="color: #718c00;">template</span><span style="color: #f5871f;"> deref</span>(k670164: <span style="color: #4271ae;">int</span>): <span style="color: #4271ae;">untyped</span> =
<span class="linenr">15: </span>      xx670162.d[k670164]
<span class="linenr">16: </span>    substVars((x += y * z), deref)
</pre>
</div>
</div>
</div>
